# Add Homebrew repositories
tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/gui'
tap 'homebrew/services'
tap 'homebrew/versions'

# Install packages
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'python'
brew 'atk'
brew 'autoconf'
brew 'awscli'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'libassuan'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'doctl'
brew 'dos2unix'
brew 'elasticsearch'
brew 'ffmpeg'
brew 'jpeg'
brew 'gd'
brew 'gdk-pixbuf'
brew 'git-extras'
brew 'gnome-icon-theme'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnupg'
brew 'lua'
brew 'gnuplot'
brew 'gpg-agent'
brew 'gsettings-desktop-schemas'
brew 'hicolor-icon-theme'
brew 'libepoxy'
brew 'gtk+3'
brew 'gtksourceview3'
brew 'htop-osx'
brew 'httpie'
brew 'hugo'
brew 'libtool'
brew 'perl'
brew 'imagemagick'
brew 'oniguruma'
brew 'jq'
brew 'libevent'
brew 'libusb-compat'
brew 'libnfc'
brew 'libssh2'
brew 'libyaml'
brew 'md5sha1sum'
brew 'midnight-commander'
brew 'minio'
brew 'mongodb', restart_service: true
brew 'ncdu'
brew 'node'
brew 'phantomjs'
brew 'postgresql'
brew 'py2cairo'
brew 'pygobject3'
brew 'ruby-build'
brew 'rbenv'
brew 'redis', restart_service: true
brew 'ruby'
brew 'shellcheck'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'v8@3.15'
brew 'vim'
brew 'wget'
brew 'yarn'

# Install desktop apps
cask 'keepassx'
cask 'meld'
