#
## Homebrew Bundle tool
#

# To install all packages execute: brew bundle


#
## Repositories
#
tap "homebrew/core"
tap "homebrew/homebrew-bundle"
tap "homebrew/homebrew-cask"
tap "homebrew/services"

#
## Tools
#
brew "asdf"
brew "bash"
brew "bash-completion@2"
brew "buildpacks/tap/pack"
brew "coreutils"
brew "direnv"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gpg" # for nodejs install
brew "htop"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "libffi" # for ruby build
brew "libyaml" # for ruby build
brew "mas"
brew "mc"
brew "ncdu"
brew "openssl" # for ruby build
brew "postgresql", restart_service: true
brew "s3cmd"
brew "shellcheck"
brew "terminal-notifier"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"

#
## Apps
#
cask "cyberduck"
cask "docker"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "licecap"
cask "meld"
cask "ngrok"
cask "postico"
cask "qlvideo"
cask "rubymine"
cask "teamviewer"
cask "the-unarchiver"
cask "tunnelblick"
cask "virtualbox"
cask "vlc"
cask "whatsapp"
