#
## Homebrew Bundle tool
#

# To install all packages execute: brew bundle


#
## Repositories
#
tap "homebrew/core"
tap "homebrew/homebrew-bundle"
tap "homebrew/homebrew-cask"
tap "homebrew/services"

#
## Tools
#
brew "asdf"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "direnv"
brew "fd"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gpg" # for nodejs install
brew "htop"
brew "imagemagick"
brew "jq"
brew "libffi" # for ruby build
brew "libpq" # for pg gem build
brew "libyaml" # for ruby build
brew "mas"
brew "mc"
brew "mysql-connector-c"
brew "ncdu"
brew "openssl" # for ruby build
brew "ripgrep"
brew "s3cmd"
brew "terminal-notifier"
brew "tree"
brew "vim"
brew "wget"

#
## Apps
#
cask "arduino"
cask "appcleaner"
cask "chirp"
cask "cyberduck"
cask "docker"
cask "easyeda"
# cask "istat-menus"
cask "meld"
cask "ngrok"
cask "postico"
cask "postman"
cask "qlvideo"
cask "raspberry-pi-imager"
cask "rectangle"
cask "redisinsight"
cask "rubymine"
cask "sequel-pro"
# cask "sweet-home3d"
cask "the-unarchiver"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
